Revit 2027 API
StructuralSectionSigmaProfileWithLips.TopBendLength Property
 Top Bend segment length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TopBendLength { get; set; }
Public Property TopBendLength As Double
	Get
	Set
public:
property double TopBendLength {
	double get ();
	void set (double value);
}
member TopBendLength : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionSigmaProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace